Revit 2027 API
AllowLargeGeometry Enumeration
 An enumerated type containing settings information related to handling of large geometries.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AllowLargeGeometry
Public Enumeration AllowLargeGeometry
public enum class AllowLargeGeometry
type AllowLargeGeometry
Members
Member name | Value | Description
Allow | 1 |  Allow export/path of travel creation on large geometries.
DisAllow | 0 |  Cancel the export/path of travel creation, failing with the apporiate status.
Prompt | 2 |  Prompt in the UI. If no UI is present, default will be DisAllow.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace